scripts/paper3/openfoam/snappyHexMesh/0.Orig/C_OH.electrolyte
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      C_OH;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 6800;

boundaryField
{

    "inlet_(.*)"
    {
    	type		fixedValue;
    	value		uniform 6800;
    }

    "outlet_(.*)"
    {
        type            zeroGradient;
        inletValue      $internalField;
    }

    "wall.*"
    {
	type 		zeroGradient;
        //	type 		zeroGradient;
    }
    
}


// ************************************************************************* //
