scripts/paper3/openfoam/snappyHexMesh/0.Orig/NeC
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      NeC;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "inlet_(.*)"
    {
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }
    "outlet_(.*)"
    {
        type            zeroGradient;
    }
    wallAnode
    {
        type            zeroGradient;
    }
    wallCathode
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
