scripts/paper3/openfoam/snappyHexMesh/constant/speciesProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

gas
{

}

electrolyte
{
    	//read by species mixture
    	z_OH	-1;		//charge
	z_H2O	0;		//charge
	z_H2	0;		//charge
	z_O2	0;		//charge
	z_K	1;		//charge
	u_OH	2.05e-3;	//Mobility
	u_K	7.619e-4;	//Mobility

	//diffusion related constants
	Ea_H2O		16762.54;
	Ea_OH		16514.4;
	Ea_K        16514.4;//VERY BIG GUESS
	Ea_H2		19344.19;
	Ea_O2		20171.89;

	D_H2O_ref	2.272e-9;
	D_OH_ref	5.27e-9;
	D_K_ref	    1.957e-9;
	D_H2_ref	5.8e-9;
	D_O2_ref	1.9e-9;

	//T_ref_25	298;
	//T_ref_80	353;

	T_ref_H2	298;
	T_ref_O2	298;
	T_ref_H2O	353;
	T_ref_OH	298;
	T_ref_K	298;
    
}
//mole weight
MW_H2		2.01588e-3;	//kg/mol
MW_O2		31.9988e-3;	//kg/mol
MW_OH		17.007e-3;	//kg/mol
MW_H2O		18.01528e-3;	//kg/mol
MW_K		39.10e-3;	//kg/mol


// ************************************************************************* //
