scripts/paper3/openfoam/snappyHexMesh/system/alphaGasU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      set1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    alphaGasU
{
    // Mandatory entries
    type     exprField;
    libs     (fieldFunctionObjects);
    field    pTot;
    /// action new;
    ///autowrite       false;
    ///store           true;
    useNamePrefix   false;

    // Use expression to define total pressure

    executeControl  timeStep;
    writeControl    none;

    expression  "p_rgh + 0.5*(rho * magSqr(U))";
    dimensions  [ Pa ];
}


  
// ************************************************************************* //


