scripts/paper3/openfoam/snappyHexMesh/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/foamPara.in"

scale   1;

vertices
(
    ($xMin $yMin $zMin)
    ($xMax  $yMin $zMin)
    ($xMax   $yMax $zMin)
    ($xMin  $yMax $zMin)
    ($xMin $yMin $zMax)
    ($xMax  $yMin $zMax)
    ($xMax   $yMax $zMax)
    ($xMin  $yMax $zMax)
    
);

blocks
(                         //x y z
    hex (0 1 2 3 4 5 6 7) ($MX $MY $MZ) //simpleGrading (1 1 1)
    simpleGrading (1 1 1)    
);

edges
(
);

boundary
(



    walls
    {
        type wall;
        faces
        (
            (1 2 6 5)   // xmax
            (0 4 7 3)
            (0 1 5 4)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }




);

mergePatchPairs
(
);

// ************************************************************************* //
