scripts/paper3/openfoam/snappyHexMesh/system/extractData
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      set1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

extractData
{
        type            surfaces;
        libs            (sampling);
        enabled         true;
	    writeControl    runTime;
	    writeInterval   0.1;

        interpolationScheme cellPointFace;
        surfaceFormat       vtk;

        fields          (alpha.gas U UNe UPe Ne Pe J Ie C_OH.electrolyte C_H2O.electrolyte C_H2.electrolyte C_O2.electrolyte NeC Ne PeC Pe);

        surfaces
        {
        
            #include "$FOAM_CASE/system/planesZ.inc"
            #include "$FOAM_CASE/system/planesX"
        }
}

  
// ************************************************************************* //


