scripts/paper3/openfoam/snappyHexMesh/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
	nAlphaCorr	3;
	nAlphaSubCycles	3;
	
        solver          PBiCGStab;
        preconditioner	FDIC;
        
        tolerance       1e-6;
        relTol          0;
        minIter         1;
    }


    "p(|_rgh)"
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.01;
        smoother        DIC;
        nCellsInCoarsestLevel 20;
    }

    "p(|_rgh)Final"
    {
        $p;
        relTol          0;
    }

    "(U|k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.1;
        minIter         1;
    }


    "C.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-15;
        relTol          0;
    }
"(UPe|UNe)"
{
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-7;
    relTol          0.01;
    minIter         1;
}
"(UNe|UPe)Final"
{
    $UNe;
    relTol          0;
    tolerance       1e-8;
}
Ue
{
    solver          GAMG;
    tolerance       1e-7;
    relTol          0.01;

    smoother        DICGaussSeidel;   // or GaussSeidel
    nPreSweeps      0;
    nPostSweeps     2;
    cacheAgglomeration true;
    agglomerator    faceAreaPair;
    mergeLevels     1;
}
UeFinal
{
    $Ue;
    tolerance       1e-8;
    relTol          0.0;
}
        UFinal
    {
        //solver          smoothSolver;
        //smoother        GaussSeidel;
                smoother        GaussSeidel;
        solver          GAMG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.0;
    }

}

PIMPLE
{
    momentumPredictor no;
    nCorrectors     3;
    nNonOrthogonalCorrectors 4;
    nOuterCorrectors    1;

	pRefPoint	(0 0.00213 0);
	pRefValue	0;
}
AlkaWE
{
	potentialCorrections	1;
	speciesCorrections	0;
	outerChemicalCorrections 1;
}
relaxationFactors
{
    equations
    {
        ".*"           1;
        U		0.7;
    }
}


// ************************************************************************* //
