scripts/paper3/openfoam/snappyHexMesh/system/pidUNeDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "system";
    object      pidUNeDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


default
{
    controlMode average;
    jGoal 2485.86; //correcting for exrtra area!(2402) //midzonePlane does not report 3000A/m² correcting with 1.035

    Kp 0.007e-2; 
    Ki 0;
    dUmax 0.1;

    Umin -10;
    Umax -1.35;

    updateEveryNTimeSteps 5;
    verbose false;

    // set true only when you want to re-init/re-zero integral
    resetController false;
}


