scripts/paper3/openfoam/snappyHexMesh/system/planesX
// Auto-generated by gen_planes_z.py
// zmin=-0.05, zmax=0.05, n=50

planeX0
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.05 0 0);
    normal  (1 0 0);
}

planeX1
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.04795918367 0 0);
    normal  (1 0 0);
}

planeX2
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.04591836735 0 0);
    normal  (1 0 0);
}

planeX3
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.04387755102 0 0);
    normal  (1 0 0);
}

planeX4
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.04183673469 0 0);
    normal  (1 0 0);
}

planeX5
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.03979591837 0 0);
    normal  (1 0 0);
}

planeX6
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.03775510204 0 0);
    normal  (1 0 0);
}

planeX7
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.03571428571 0 0);
    normal  (1 0 0);
}

planeX8
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.03367346939 0 0);
    normal  (1 0 0);
}

planeX9
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.03163265306 0 0);
    normal  (1 0 0);
}

planeX10
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.02959183673 0 0);
    normal  (1 0 0);
}

planeX11
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.02755102041 0 0);
    normal  (1 0 0);
}

planeX12
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.02551020408 0 0);
    normal  (1 0 0);
}

planeX13
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.02346938776 0 0);
    normal  (1 0 0);
}

planeX14
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.02142857143 0 0);
    normal  (1 0 0);
}

planeX15
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.0193877551 0 0);
    normal  (1 0 0);
}

planeX16
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.01734693878 0 0);
    normal  (1 0 0);
}

planeX17
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.01530612245 0 0);
    normal  (1 0 0);
}

planeX18
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.01326530612 0 0);
    normal  (1 0 0);
}

planeX19
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.0112244898 0 0);
    normal  (1 0 0);
}

planeX20
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.009183673469 0 0);
    normal  (1 0 0);
}

planeX21
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.007142857143 0 0);
    normal  (1 0 0);
}

planeX22
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.005102040816 0 0);
    normal  (1 0 0);
}

planeX23
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.00306122449 0 0);
    normal  (1 0 0);
}

planeX24
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (-0.001020408163 0 0);
    normal  (1 0 0);
}

planeX25
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.001020408163 0 0);
    normal  (1 0 0);
}

planeX26
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.00306122449 0 0);
    normal  (1 0 0);
}

planeX27
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.005102040816 0 0);
    normal  (1 0 0);
}

planeX28
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.007142857143 0 0);
    normal  (1 0 0);
}

planeX29
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.009183673469 0 0);
    normal  (1 0 0);
}

planeX30
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.0112244898 0 0);
    normal  (1 0 0);
}

planeX31
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.01326530612 0 0);
    normal  (1 0 0);
}

planeX32
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.01530612245 0 0);
    normal  (1 0 0);
}

planeX33
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.01734693878 0 0);
    normal  (1 0 0);
}

planeX34
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.0193877551 0 0);
    normal  (1 0 0);
}

planeX35
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.02142857143 0 0);
    normal  (1 0 0);
}

planeX36
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.02346938776 0 0);
    normal  (1 0 0);
}

planeX37
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.02551020408 0 0);
    normal  (1 0 0);
}

planeX38
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.02755102041 0 0);
    normal  (1 0 0);
}

planeX39
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.02959183673 0 0);
    normal  (1 0 0);
}

planeX40
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.03163265306 0 0);
    normal  (1 0 0);
}

planeX41
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.03367346939 0 0);
    normal  (1 0 0);
}

planeX42
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.03571428571 0 0);
    normal  (1 0 0);
}

planeX43
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.03775510204 0 0);
    normal  (1 0 0);
}

planeX44
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.03979591837 0 0);
    normal  (1 0 0);
}

planeX45
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.04183673469 0 0);
    normal  (1 0 0);
}

planeX46
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.04387755102 0 0);
    normal  (1 0 0);
}

planeX47
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.04591836735 0 0);
    normal  (1 0 0);
}

planeX48
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.04795918367 0 0);
    normal  (1 0 0);
}

planeX49
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0.05 0 0);
    normal  (1 0 0);
}

