scripts/paper3/openfoam/snappyHexMesh/system/planesZ.inc
// Auto-generated by gen_planes_z.py
// zmin=-0.0075, zmax=0.0075, n=30

plane0
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 -0.0075);
    normal  (0 0 1);
}

plane1
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 -0.006982758621);
    normal  (0 0 1);
}

plane2
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 -0.006465517241);
    normal  (0 0 1);
}

plane3
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 -0.005948275862);
    normal  (0 0 1);
}

plane4
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 -0.005431034483);
    normal  (0 0 1);
}

plane5
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 -0.004913793103);
    normal  (0 0 1);
}

plane6
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 -0.004396551724);
    normal  (0 0 1);
}

plane7
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 -0.003879310345);
    normal  (0 0 1);
}

plane8
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 -0.003362068966);
    normal  (0 0 1);
}

plane9
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 -0.002844827586);
    normal  (0 0 1);
}

plane10
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 -0.002327586207);
    normal  (0 0 1);
}

plane11
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 -0.001810344828);
    normal  (0 0 1);
}

plane12
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 -0.001293103448);
    normal  (0 0 1);
}

plane13
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 -0.000775862069);
    normal  (0 0 1);
}

plane14
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 -0.0002586206897);
    normal  (0 0 1);
}

plane15
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 0.0002586206897);
    normal  (0 0 1);
}

plane16
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 0.000775862069);
    normal  (0 0 1);
}

plane17
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 0.001293103448);
    normal  (0 0 1);
}

plane18
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 0.001810344828);
    normal  (0 0 1);
}

plane19
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 0.002327586207);
    normal  (0 0 1);
}

plane20
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 0.002844827586);
    normal  (0 0 1);
}

plane21
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 0.003362068966);
    normal  (0 0 1);
}

plane22
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 0.003879310345);
    normal  (0 0 1);
}

plane23
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 0.004396551724);
    normal  (0 0 1);
}

plane24
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 0.004913793103);
    normal  (0 0 1);
}

plane25
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 0.005431034483);
    normal  (0 0 1);
}

plane26
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 0.005948275862);
    normal  (0 0 1);
}

plane27
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 0.006465517241);
    normal  (0 0 1);
}

plane28
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 0.006982758621);
    normal  (0 0 1);
}

plane29
{
    type    plane;
    source  cell;
    store   false;
    interpolate false;

    point   (0 0 0.0075);
    normal  (0 0 1);
}

