scripts/paper3/openfoam/snappyHexMesh/system/set1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      set1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    outletGasVolFlow
{
    type            surfaceFieldValue;
    libs            ("libfieldFunctionObjects.so");

    regionType      patch;
    name            outlet_cathode;

    fields          (alpha.gas);
    weightField     phi;

    operation       weightedAverage;

    writeControl    runTime;
    writeInterval   0.1;

    writeFields     false;
    log             true;
}

  
// ************************************************************************* //


