scripts/paper3/openfoam/snappyHexMesh/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


//aussenBlock.stl
//{
//    extractionMethod    extractFromSurface  ;
//    includedAngle       180;
//    writeObj            yes;
//}


fluid.stl 
{
    extractionMethod    extractFromSurface  ;
    includedAngle       180;
    writeObj            yes;
}


// ************************************************************************* //
