scripts/paper3/openfoam/snappyHexMesh/system/topoSetDict.DiaRefInterFace
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Copyright held by the original author
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/foamPara.in"
actions
(

    {
        // Mandatory (inherited) entries
        name        diaphrameSetInterFace1;
        type        cellSet;
        action      new;

        // Mandatory entries
        source      boxToCell;

        // Conditional mandatory entries
        // Select either of the below

        // Option-2 
        box (#eval{$xMin*1e-3} #eval{$yMin*1e-3} -0.6225e-3) (#eval{$xMax*1e-3}   #eval{$yMax*1e-3} -0.2225e-3);
    }
        {
        // Mandatory (inherited) entries
        name        diaphrameSetInterFace1;
        type        cellSet;
        action      add;

        // Mandatory entries
        source      boxToCell;

        // Conditional mandatory entries
        // Select either of the below

        // Option-2 
        box (#eval{$xMin*1e-3} #eval{$yMin*1e-3} 0.2225e-3) (#eval{$xMax*1e-3}   #eval{$yMax*1e-3} 0.6225e-3);
    }


);
// ************************************************************************* //
