scripts/paper3/openfoam/snappyHexMesh/system/topoSetDict.zone
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Copyright held by the original author
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "$FOAM_CASE/foamPara.in"
actions
(

    {
        // Mandatory (inherited) entries
        name        diaphrameSet;
        type        cellSet;
        action      new;

        // Mandatory entries
        source      boxToCell;

        // Conditional mandatory entries
        // Select either of the below

        // Option-2 
        box (#eval{$xMin*1e-3} #eval{$yMin*1e-3} #eval{-(0.85e-3)/2}) (#eval{$xMax*1e-3}   #eval{$yMax*1e-3} #eval{(0.85e-3)/2});
    }
    
    {
        // Mandatory (inherited) entries
        name        anodeSet;
        type        cellSet;
        action      new;

        // Mandatory entries
        source      boxToCell;

        // Conditional mandatory entries
        // Select either of the below

        // Option-2 
        box (#eval{$xMin*1e-3} #eval{$yMin*1e-3} #eval{-(0.85e-3)/2-1.8e-3}) (#eval{$xMax*1e-3}  #eval{$yMax*1e-3} #eval{-(0.85e-3)/2});
    }
        {
        // Mandatory (inherited) entries
        name        cathodeSet;
        type        cellSet;
        action      new;

        // Mandatory entries
        source      boxToCell;

        // Conditional mandatory entries
        // Select either of the below

        // Option-2 
        box (#eval{$xMin*1e-3} #eval{$yMin*1e-3} #eval{(0.85e-3)/2}) (#eval{$xMax*1e-3}   #eval{$yMax*1e-3} #eval{(0.85e-3)/2+1.8e-3});
    }
        {
        // Mandatory (inherited) entries
        name        cathodeChannelSet;
        type        cellSet;
        action      new;

        // Mandatory entries
        source      boxToCell;

        // Conditional mandatory entries
        // Select either of the below

        // Option-2 
        box (#eval{$xMin*1e-3} #eval{$yMin*1e-3} 0) (#eval{$xMax*1e-3}   #eval{$yMax*1e-3} #eval{$zMax*1e-3});
    }   
            {
        // Mandatory (inherited) entries
        name        anodeChannelSet;
        type        cellSet;
        action      new;

        // Mandatory entries
        source      boxToCell;

        // Conditional mandatory entries
        // Select either of the below

        // Option-2 
        box (#eval{$xMin*1e-3} #eval{$yMin*1e-3} #eval{$zMin*1e-3}) (#eval{$xMax*1e-3}   #eval{$yMax*1e-3} 0);
    }
          {
        // Mandatory (inherited) entries
        name        anodeChannelSet;
        type        cellSet;
        action      subtract;

        // Mandatory entries
        source      cellToCell;

        sets
        ( 
            anodeSet diaphrameSet  
        );
    } 
    {
        // Mandatory (inherited) entries
        name        cathodeChannelSet;
        type        cellSet;
        action      subtract;

        // Mandatory entries
        source      cellToCell;

        sets
        ( 
            cathodeSet
            diaphrameSet  
        );
    } 
    {
        // Mandatory (inherited) entries
        name        anode;
        type        cellZoneSet;
        action      new;

        // Mandatory entries
        source      setToCellZone;

        set anodeSet;
    }    
    {
        // Mandatory (inherited) entries
        name        cathode;
        type        cellZoneSet;
        action      new;

        // Mandatory entries
        source      setToCellZone;

        set cathodeSet;
    } 
    {
        // Mandatory (inherited) entries
        name        diaphrame;
        type        cellZoneSet;
        action      new;

        // Mandatory entries
        source      setToCellZone;

        set diaphrameSet;
    }
    {
        // Mandatory (inherited) entries
        name        cathodeChannel;
        type        cellZoneSet;
        action      new;

        // Mandatory entries
        source      setToCellZone;

        set cathodeChannelSet;
    }
    {
        // Mandatory (inherited) entries
        name        anodeChannel;
        type        cellZoneSet;
        action      new;

        // Mandatory entries
        source      setToCellZone;

        set anodeChannelSet;
    }
    
        {
        name        midPlaneZone;
        type        faceZoneSet;
        action      new;
        source      planeToFaceZone;
        point       (0.0 0.0 0.0);
        normal      (0 0 1);
        option      closest;
    }
        

);
// ************************************************************************* //
